

extension UserAgreementModel {
    static let mocks = UserAgreementConfig(namesOffer: "Оферта на оказание образовательных услуг дополнительного образования Яндекс.Практикум для физических лиц", linkOfDocument: """
                Данный документ является действующим, если расположен по адресу: https://yandex.ru/legal/practicum_offer 
                
                Российская Федерация, город Москва
                
                """, textDocument: """
            Понятия, используемые в настоящей Оферте, означают следующее:
            
            Авторизованные адреса — адреса электронной почты каждой Стороны. Авторизованным адресом Исполнителя на входящие сообщения является адрес электронной почты, указанный в разделе 11 Оферты, Авторизованными адресами Исполнителя на исходящие сообщения являются адреса электронной почты, использующие доменное имя @yandex-team.xx , где .xx может быть любым доменом верхнего уровня (.ru, .com и т.д.). Авторизованным адресом Студента является адрес электронной почты, указанный Студентом в Личном кабинете.
            
            Вводный курс — начальный курс обучения, предусмотренный в отдельных представленных в Сервисе Программах обучения в рамках выбранного Студентом Курса, рассчитанный на определенное количество часов самостоятельного обучения, который однократно предоставляется Студенту при регистрации в Сервисе на безвозмездной основе. В процессе обучения в рамках Вводного курса Студенту предоставляется возможность ознакомления с работой Сервиса и определения возможности Студента продолжить обучение в рамках Полного курса по выбранному Студентом Курсу. Точное количество часов обучения в рамках Вводного курса зависит от выбранного Студентом Курса и определяется в Программе обучения, размещенной на Сервисе. Максимальный срок освоения Вводного курса составляет 1 год с даты начала обучения.
            
            Договор об образовании — договор об оказании платных образовательных услуг по дополнительным образовательным программам (дополнительным общеобразовательным программам и дополнительным профессиональным программам), заключенный между Исполнителем и Студентом (или его Законным представителем в случае недостижения Студентом возраста, с которого законодательством Российской Федерации допускается заключение данного договора) в письменной форме в соответствии с пунктом 2 статьи 434 ГК РФ путем обмена электронными документами, а именно путем акцепта Студентом Оферты в порядке, предусмотренном в разделе 4 настоящей Оферты.
            
            Исполнитель — Автономная Некоммерческая Организация Дополнительного Профессионального Образования «Образовательные технологии Яндекса», ОГРН 1147799006123, Лицензия № Л035-01298-77/00185314 от 24 марта 2015 года, место нахождения: 119021, Россия, г. Москва, ул. Тимура Фрунзе, д. 11, корпус 2, https://practicum.yandex.ru.
            
            Когорта — группа Студентов, зачисляемая на выбранную такими Студентами Программу обучения в рамках Полного курса. Дата начала обучения Когорты отображается на странице оплаты при оплате Студентом Полного курса, а после оплаты в Личном кабинете Студента.
            
            Курс — направление обучения по Программам, представленным на Сервисе, с определенным набором модулей, информация о которых размещена на Сервисе.
            
            Личный кабинет/Личный кабинет Студента — специальный раздел Сервиса, позволяющий зарегистрированному и авторизованному Студенту получить доступ к своей Персональной информации в Сервисе, а также полученным и приобретенным Студентом Программам, включая все методические материалы, аудиовизуальный контент, предоставленный в рамках Программ.
            
            Модуль — набор обучающих текстов, аудиовизуальных материалов и практических задач, объединенных определенной тематикой в рамках Программ.
            
            Оферта — настоящий документ, представляющий собой оферту, направленную Исполнителем Студентам на заключение Договора об образовании на Сервисе, размещенный в открытом доступе в сети «Интернет» по адресу: https://yandex.ru/legal/practicum_offer.
            
            Пакет занятий — количество занятий, содержащееся в приобретённой Студентом/Пользователем Программе английского языка. Количество занятий в Программах английского языка размещено по адресу https://practicum.yandex.ru/english. График проведения занятий по Программам английского языка фиксируется в Личном кабинете.
            
            Персональная информация — информация о Студенте и/или Законном представителе, включая персональные данные, предоставленная Студентом или Законным представителем в Сервисе, при акцепте Оферты или иным образом в связи с использованием Сервиса с целью исполнения условий Оферты.
            
            Программы английского языка - образовательные Программы по обучению английскому языку, перечень которых указан по адресу https://practicum.yandex.ru/english.
            
            Полный курс — расширенный платный курс обучения по представленным в Сервисе Программам в рамках выбранного Студентом Курса, рассчитанный на определенное количество часов обучения (самостоятельное обучения и обучение с привлечением преподавателей), включающий в себя расширенный набор теоретических, практических, аудиовизуальных материалов для самостоятельного обучения, а также возможность персонального сопровождения Студента в рамках выбранного Студентом Курса практикующим специалистом Сервиса (наставником, тьютором, тренером), если это предусмотрено Программой обучения. Точное количество часов обучения в рамках Полного курса зависит от выбранного Студентом Курса и определяется в Программе обучения, размещенной в Сервисе. Обучение по программе Полного курса может происходить в Когортах, если это предусмотрено соответствующим Курсом. Дата начала обучения устанавливается для всей Когорты. Максимальный срок освоения Полного курса указан в Сервисе.
            
            Пользовательское соглашение/Условия Сервиса — условия использования Сервиса, размещенные в сети Интернет по адресу: https://yandex.ru/legal/practicum_termsofuse.
            
            Привязанная банковская карта — одна или несколько банковских карт Студента, данные которых указаны и доступны в Сервисе, в соответствии с Пользовательским соглашением и в соответствии с Офертой, а также данные которой доступны в учетной записи Студента на сервисе «Яндекс ID», доступного по адресу: https://passport.yandex.ru в соответствии с пользовательским соглашением сервисов Яндекса, размещенным в сети Интернет по адресу: https://yandex.ru/legal/rules.
            
            Программа/Образовательная программа — дополнительная профессиональная программа или дополнительная общеобразовательная общеразвивающая программа в форме обучения (в том числе в форме индивидуального обучения, если это предусмотрено соответствующим Курсом) по определенному Курсу, размещенная на Сервисе. Программа обучения может состоять из Вводного и Полного курсов. Срок освоения Программы размещен на Сервисе.
            
            Сервис — сервис Яндекс Практикум, доступный для Студентов по адресу: https://practicum.yandex.ru и https://practicum.yandex.ru/english, с использованием которого Исполнитель оказывает Услуги Студентам.
            
            Стоимость обучения — стоимость Полного курса обучения, указанная в Сервисе.
            
            Стороны — совместное упоминание Исполнителя и Студента.
            
            Студент/Пользователь — любое совершеннолетнее физическое лицо или несовершеннолетнее физическое лицо в лице его Законного представителя, а в случае достижения четырнадцатилетнего возраста - действующее с согласия и под наблюдением Законного представителя, являющееся зарегистрированным и авторизованным пользователем согласно Условиям Сервиса, которое ознакомилось с условиями настоящей Оферты и акцептовало настоящую оферту путем нажатия кнопки/проставления галочки в пункте «Начать учиться»/«Купить» или «Принимаю условия Пользовательского соглашения» и «Оферты» в Сервисе.
            
            Законный представитель — родитель, усыновитель или опекун несовершеннолетнего Студента. По смыслу настоящей Оферты при каждом упоминании Студента, являющегося несовершеннолетним, а также при упоминании прав, обязательств или действий такого Студента, подразумевающих создание, изменение или прекращение правоотношений в рамках настоящей Оферты, понимается Законный представитель такого Студента.
            
            Услуга — образовательная услуга по Программам, оказываемая Исполнителем Студенту в соответствии с выбранным Студентом Курсом на Сервисе в дистанционной (онлайн) форме обучения на Сервисе.
            
            Условия использования Промокодов — условия использования Промокодов в рамках Курсов «Яндекс Практикум», расположенные в сети Интернет по адресу: https://yandex.ru/legal/practicum_promocode.
            
            Термины, не определенные в настоящем разделе, будут иметь значения, данные им в действующей редакции Гражданского кодекса Российской Федерации и иных нормативно-правовых актах РФ.
            """, nameOfApi: "Приложение использует API «Яндекс.Расписания", version: "Версия 1.0 (beta)")
}

